roboter/Hardware/GigaDevice/GD32VF103/GD-Link Programmer/OptionBytesXML/GD32E10x.xml
<!--NodeType> complement !=FFFF is complement byte</NodeType-->
<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<OPBytesBlocks>
    <OPBytesBlock baseAddress="0x1FFFF800" length="12"/>
</OPBytesBlocks>
<OPBytes baseAddress="0x1FFFF800" length="12">
    <OPByte>
        <name>SPC</name>
        <displayName>SPC</displayName>
        <addressOffset>0x0</addressOffset>
        <size>0x8</size>
        <access>read-write</access>
		<reset>0xA5</reset>
        <complement>FFFF</complement>
        <fields>
            <field>
                <name>SPC</name>
                <brief>Option byte security protection value</brief>
                <description>Option byte security protection value&#x000A;0xA5 : no security protection&#x000A;any value except 0xA5 : under security protection</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
            </field>
        </fields>
    </OPByte>
    <OPByte>
        <name>SPC_N</name>
        <displayName>SPC_N</displayName>
        <addressOffset>0x1</addressOffset>
        <size>0x8</size>
        <access>read</access>
		<reset>0x5A</reset>
        <complement>0</complement>
        <fields>
            <field>
                <name>SPC_N</name>
                <brief>SPC complement value</brief>
                <description>SPC complement value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
            </field>
        </fields>
    </OPByte>
    <OPByte>
        <name>USER</name>
        <displayName>USER</displayName>
        <addressOffset>0x2</addressOffset>
        <size>0x8</size>
        <access>read-write</access>
		<reset>0xFF</reset>
        <complement>FFFF</complement>
        <fields>
            <field>
                <name>nRST_STDBY</name>
                <brief>Generate a reset instead of entering standby mode</brief>
                <description>nRST_STDBY&#x000A;0: generate a reset instead of entering standby mode&#x000A;1: no reset when entering standby mode</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>nRST_DPSLP</name>
                <brief>Generate a reset instead of entering Deep-sleep mode</brief>
                <description>nRST_DPSLP&#x000A;0: generate a reset instead of entering Deep-sleep mode&#x000A;1: no reset when entering Deep-sleep mode</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>nWDG_HW</name>
                <brief>Hardware free watchdog</brief>
                <description>nWDG_HW&#x000A;0: hardware free watchdog&#x000A;1: software free watchdog</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
        </fields>
    </OPByte>
    <OPByte>
        <name>USER_N</name>
        <displayName>USER_N</displayName>
        <addressOffset>0x3</addressOffset>
        <size>0x8</size>
        <access>read</access>
		<reset>0x00</reset>
        <complement>0x2</complement>
        <fields>
            <field>
                <name>USER_N</name>
                <brief>USER complement value</brief>
                <description>USER complement value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
            </field>
        </fields>
    </OPByte>
    <OPByte>
        <name>DATA[7:0]</name>
        <displayName>DATA[7:0]</displayName>
        <addressOffset>0x4</addressOffset>
        <size>0x8</size>
        <access>read-write</access>
		<reset>0xFF</reset>
        <complement>FFFF</complement>
        <fields>
            <field>
                <name>DATA[7:0]</name>
                <brief>user defined data bit 7 to 0</brief>
                <description>user defined data bit 7 to 0</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
            </field>
        </fields>
    </OPByte>
    <OPByte>
        <name>DATA_N[7:0]</name>
        <displayName>DATA_N[7:0]</displayName>
        <addressOffset>0x5</addressOffset>
        <size>0x8</size>
        <access>read</access>
		<reset>0x00</reset>
        <complement>0x4</complement>
        <fields>
            <field>
                <name>DATA_N[7:0]</name>
                <brief>DATA complement value bit 7 to 0</brief>
                <description>DATA complement value bit 7 to 0</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
            </field>
        </fields>
    </OPByte>
    <OPByte>
        <name>DATA[15:8]</name>
        <displayName>DATA[15:8]</displayName>
        <addressOffset>0x6</addressOffset>
        <size>0x8</size>
        <access>read-write</access>
		<reset>0xFF</reset>
        <complement>FFFF</complement>
        <fields>
            <field>
                <name>DATA[15:8]</name>
                <brief>user defined data bit 15 to 8</brief>
                <description>user defined data bit 15 to 8</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
            </field>
        </fields>
    </OPByte>
    <OPByte>
        <name>DATA_N[15:8]</name>
        <displayName>DATA_N[15:8]</displayName>
        <addressOffset>0x7</addressOffset>
        <size>0x8</size>
        <access>read</access>
		<reset>0x00</reset>
        <complement>0x6</complement>
        <fields>
            <field>
                <name>DATA_N[15:8]</name>
                <brief>DATA complement value bit 15 to 8</brief>
                <description>DATA complement value bit 15 to 8</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
            </field>
        </fields>
    </OPByte>
    <OPByte>
        <name>WP[7:0]</name>
        <displayName>WP[7:0]</displayName>
        <addressOffset>0x8</addressOffset>
        <size>0x8</size>
        <access>read-write</access>
		<reset>0xFF</reset>
        <complement>FFFF</complement>
        <fields>
            <field>
                <name>WP[7]</name>
                <brief>0x08007000~0x08007FFF</brief>
                <description>Page Erase/Program Protection bit 7(0x08007000~0x08007FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>WP[6]</name>
                <brief>0x08006000~0x08006FFF</brief>
                <description>Page Erase/Program Protection bit 6(0x08006000~0x08006FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>WP[5]</name>
                <brief>0x08005000~0x08005FFF</brief>
                <description>Page Erase/Program Protection bit 5(0x08005000~0x08005FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>WP[4]</name>
                <brief>0x08004000~0x08004FFF</brief>
                <description>Page Erase/Program Protection bit 4(0x08004000~0x08004FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>WP[3]</name>
                <brief>0x08003000~0x08003FFF</brief>
                <description>Page Erase/Program Protection bit 3(0x08003000~0x08003FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>WP[2]</name>
                <brief>0x08002000~0x08002FFF</brief>
                <description>Page Erase/Program Protection bit 2(0x08002000~0x08002FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>WP[1]</name>
                <brief>0x08001000~0x08001FFF</brief>
                <description>Page Erase/Program Protection bit 1(0x08001000~0x08001FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>WP[0]</name>
                <brief>0x08000000~0x08000FFF</brief>
                <description>Page Erase/Program Protection bit 0(0x08000000~0x08000FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
            </field>

        </fields>
    </OPByte>
    <OPByte>
        <name>WP_N[7:0]</name>
        <displayName>WP_N[7:0]</displayName>
        <addressOffset>0x9</addressOffset>
        <size>0x8</size>
        <access>read</access>
		<reset>0x00</reset>
        <complement>0x8</complement>
        <fields>
            <field>
                <name>WP_N[7:0]</name>
                <brief>WP complement value bit 7 to 0</brief>
                <description>WP complement value bit 7 to 0</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
            </field>
        </fields>
    </OPByte>
    <OPByte>
        <name>WP[15:8]</name>
        <displayName>WP[15:8]</displayName>
        <addressOffset>0xA</addressOffset>
        <size>0x8</size>
        <access>read-write</access>
		<reset>0xFF</reset>
        <complement>FFFF</complement>
        <fields>
            <field>
                <name>WP[15]</name>
                <brief>0x0800F000~0x0800FFFF</brief>
                <description>Page Erase/Program Protection bit 15(0x0800F000~0x0800FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>WP[14]</name>
                <brief>0x0800E000~0x0800EFFF</brief>
                <description>Page Erase/Program Protection bit 14(0x0800E000~0x0800EFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>WP[13]</name>
                <brief>0x0800D000~0x0800DFFF</brief>
                <description>Page Erase/Program Protection bit 13(0x0800D000~0x0800DFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>WP[12]</name>
                <brief>0x0800C000~0x0800CFFF</brief>
                <description>Page Erase/Program Protection bit 12(0x0800C000~0x0800CFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>WP[11]</name>
                <brief>0x0800B000~0x0800BFFF</brief>
                <description>Page Erase/Program Protection bit 11(0x0800B000~0x0800BFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>WP[10]</name>
                <brief>0x0800A000~0x0800AFFF</brief>
                <description>Page Erase/Program Protection bit 10(0x0800A000~0x0800AFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>WP[9]</name>
                <brief>0x08009000~0x08009FFF</brief>
                <description>Page Erase/Program Protection bit 9(0x08009000~0x08009FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
            </field>
            <field>
                <name>WP[8]</name>
                <brief>0x08008000~0x08008FFF</brief>
                <description>Page Erase/Program Protection bit 8(0x08008000~0x08008FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
            </field>

        </fields>
    </OPByte>
    <OPByte>
        <name>WP_N[15:8]</name>
        <displayName>WP_N[15:8]</displayName>
        <addressOffset>0xB</addressOffset>
        <size>0x8</size>
        <access>read</access>
		<reset>0x00</reset>
        <complement>0xA</complement>
        <fields>
            <field>
                <name>WP_N[15:8]</name>
                <brief>WP complement value bit 15 to 8</brief>
                <description>WP complement value bit 15 to 8</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
            </field>
        </fields>
    </OPByte>
</OPBytes>